
## Plan Result (demo)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 0 to change, 18 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-DATABASE
  * azurerm_key_vault_secret.POSTGRES-HOST-V15
  * azurerm_key_vault_secret.POSTGRES-PASS-V15
  * azurerm_key_vault_secret.POSTGRES-PORT
  * azurerm_key_vault_secret.POSTGRES-USER-V15
  * module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.postgresql_v15.null_resource.set-user-permissions-additionaldbs[&#34;ccd_user_profile&#34;]
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
  * module.user-profile-db-v11.azurerm_postgresql_active_directory_administrator.admin
  * module.user-profile-db-v11.azurerm_resource_group.data-resourcegroup
  * module.user-profile-db-v11.azurerm_template_deployment.postgres-paas
  * module.user-profile-db-v11.null_resource.set-user-permissions[0]
  * module.user-profile-db-v11.null_resource.subnet_mappings[0]
  * module.user-profile-db-v11.null_resource.subnet_mappings[1]
  * module.user-profile-db-v11.null_resource.subnet_mappings[2]
  * module.user-profile-db-v11.null_resource.subnet_mappings[3]
  * module.user-profile-db-v11.null_resource.subnet_mappings[4]
  * module.user-profile-db-v11.null_resource.subnet_mappings[5]
  * module.user-profile-db-v11.random_string.password
* Replace
  * module.postgresql_v15.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_v15.azurerm_postgresql_flexible_server_database.pg_databases[&#34;ccd_user_profile&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo"
      + name                    = "user-profile-api-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-HOST-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo"
      + name                    = "user-profile-api-POSTGRES-HOST-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      - id                      = "https://ccd-demo.vault.azure.net/secrets/user-profile-api-POSTGRES-PASS/91b3b579a72a486caf5203b66a86aea6" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo" -> null
      - name                    = "user-profile-api-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo/secrets/user-profile-api-POSTGRES-PASS/versions/91b3b579a72a486caf5203b66a86aea6" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo/secrets/user-profile-api-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "91b3b579a72a486caf5203b66a86aea6" -> null
      - versionless_id          = "https://ccd-demo.vault.azure.net/secrets/user-profile-api-POSTGRES-PASS" -> null

      - timeouts {}
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo"
      + name                    = "user-profile-api-POSTGRES-PASS-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo"
      + name                    = "user-profile-api-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      - id                      = "https://ccd-demo.vault.azure.net/secrets/user-profile-api-POSTGRES-USER/fb23055a8a1f4d5ab729e84dadb7bd80" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo" -> null
      - name                    = "user-profile-api-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo/secrets/user-profile-api-POSTGRES-USER/versions/fb23055a8a1f4d5ab729e84dadb7bd80" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo/secrets/user-profile-api-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "fb23055a8a1f4d5ab729e84dadb7bd80" -> null
      - versionless_id          = "https://ccd-demo.vault.azure.net/secrets/user-profile-api-POSTGRES-USER" -> null

      - timeouts {}
    }

  # azurerm_key_vault_secret.POSTGRES-USER-V15 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-V15" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo"
      + name                    = "user-profile-api-POSTGRES-USER-V15"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      - id                      = "https://ccd-demo.vault.azure.net/secrets/user-profile-api-POSTGRES-DATABASE/e318de5a5fc34be695daa58f212e5361" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo" -> null
      - name                    = "user-profile-api-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo/secrets/user-profile-api-POSTGRES-DATABASE/versions/e318de5a5fc34be695daa58f212e5361" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo/secrets/user-profile-api-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "e318de5a5fc34be695daa58f212e5361" -> null
      - versionless_id          = "https://ccd-demo.vault.azure.net/secrets/user-profile-api-POSTGRES-DATABASE" -> null

      - timeouts {}
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_HOST is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      - id                      = "https://ccd-demo.vault.azure.net/secrets/user-profile-api-POSTGRES-HOST/0c3f881c3fe345f9b247c6316d6fc761" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo" -> null
      - name                    = "user-profile-api-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo/secrets/user-profile-api-POSTGRES-HOST/versions/0c3f881c3fe345f9b247c6316d6fc761" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo/secrets/user-profile-api-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "0c3f881c3fe345f9b247c6316d6fc761" -> null
      - versionless_id          = "https://ccd-demo.vault.azure.net/secrets/user-profile-api-POSTGRES-HOST" -> null

      - timeouts {}
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PORT is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      - id                      = "https://ccd-demo.vault.azure.net/secrets/user-profile-api-POSTGRES-PORT/df6bac4b1e064a8683d3a3367dec8705" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo" -> null
      - name                    = "user-profile-api-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo/secrets/user-profile-api-POSTGRES-PORT/versions/df6bac4b1e064a8683d3a3367dec8705" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-demo/providers/Microsoft.KeyVault/vaults/ccd-demo/secrets/user-profile-api-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "df6bac4b1e064a8683d3a3367dec8705" -> null
      - versionless_id          = "https://ccd-demo.vault.azure.net/secrets/user-profile-api-POSTGRES-PORT" -> null

      - timeouts {}
    }

  # module.postgresql_v15.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ delegated_subnet_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/virtualNetworks/cft-demo-vnet/subnets/postgresql" -> "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/virtualNetworks/cft-demo-vnet/subnets/postgres-expanded" # forces replacement
      ~ fqdn                          = "ccd-user-profile-api-postgres-db-v15-demo.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-user-profile-api-postgres-db-v15-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-user-profile-api-postgres-db-v15-demo" -> (known after apply)
        name                          = "ccd-user-profile-api-postgres-db-v15-demo"
      - replication_role              = "" -> null
      ~ storage_tier                  = "P6" -> (known after apply)
        tags                          = {
            "application"         = "core-case-data"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/ccd-user-profile-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ccd-community"
            "environment"         = "demo"
            "managedBy"           = "CCD"
        }
      - zone                          = "1" -> null
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "plpgsql,pg_stat_statements,pg_buffercache,hypopg"
    }

  # module.postgresql_v15.azurerm_postgresql_flexible_server_database.pg_databases["ccd_user_profile"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-user-profile-api-postgres-db-v15-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-user-profile-api-postgres-db-v15-demo/databases/ccd_user_profile" -> (known after apply)
        name      = "ccd_user_profile"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-user-profile-api-postgres-db-v15-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccd-user-profile-api-postgres-db-v15-demo" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_v15.null_resource.set-user-permissions-additionaldbs["ccd_user_profile"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "force_trigger"  = "1"
          + "name"           = "ccd-user-profile-api-postgres-db-v15"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.user-profile-db-v11.azurerm_postgresql_active_directory_administrator.admin will be destroyed
  # (because azurerm_postgresql_active_directory_administrator.admin is not in configuration)
  - resource "azurerm_postgresql_active_directory_administrator" "admin" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-user-profile-api-postgres-db-v11-data-demo/providers/Microsoft.DBforPostgreSQL/servers/ccd-user-profile-api-postgres-db-v11-demo" -> null
      - login               = "DTS Platform Operations" -> null
      - object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - resource_group_name = "ccd-user-profile-api-postgres-db-v11-data-demo" -> null
      - server_name         = "ccd-user-profile-api-postgres-db-v11-demo" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.user-profile-db-v11.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-user-profile-api-postgres-db-v11-data-demo" -> null
      - location = "uksouth" -> null
      - name     = "ccd-user-profile-api-postgres-db-v11-data-demo" -> null
      - tags     = {
          - "application"         = "core-case-data"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/ccd-user-profile-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ccd-community"
          - "environment"         = "demo"
          - "managedBy"           = "CCD"
        } -> null
    }

  # module.user-profile-db-v11.azurerm_template_deployment.postgres-paas will be destroyed
  # (because azurerm_template_deployment.postgres-paas is not in configuration)
  - resource "azurerm_template_deployment" "postgres-paas" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-user-profile-api-postgres-db-v11-data-demo/providers/Microsoft.Resources/deployments/ccd-user-profile-api-postgres-db-v11-demo" -> null
      - name                = "ccd-user-profile-api-postgres-db-v11-demo" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "administratorLogin"         = "ccd"
          - "administratorLoginPassword" = "-i:$k4&RuCtS<nLw"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImNvcmUtY2FzZS1kYXRhIiwiYXV0b1NodXRkb3duIjoidHJ1ZSIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9jY2QtdXNlci1wcm9maWxlLWFwaS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2NjZC1jb21tdW5pdHkiLCJlbnZpcm9ubWVudCI6ImRlbW8iLCJtYW5hZ2VkQnkiOiJDQ0QifQ=="
          - "dbName"                     = "ccd_user_profile"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMWM0ZjA3MDQtYTI5ZS00MDNkLWI3MTktYjkwYzM0ZWYxNGM5L3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtZGVtby9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1kZW1vL3N1Ym5ldHMvY29yZS1pbmZyYS1zdWJuZXQtMy1kZW1vIn0seyJydWxlX25hbWUiOiJjZnRha3MtdGYtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy9kMDI1ZmVjZS1jZTk5LTRkZjItYjdhOS1iNjQ5ZDNmZjIwNjAvcmVzb3VyY2VHcm91cHMvY2Z0LWRlbW8tbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1kZW1vLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6ImNmdGFrcy10Zi1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zL2QwMjVmZWNlLWNlOTktNGRmMi1iN2E5LWI2NDlkM2ZmMjA2MC9yZXNvdXJjZUdyb3Vwcy9jZnQtZGVtby1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LWRlbW8tdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvaWFhcyJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MtYWdlbnQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJiYXN0aW9uLW5vbnByb2Qtdm5ldCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zL2I0NGViNDc5LTlhZTItNDJlNy05YzYzLWYzYzU5OTcxOWI2Zi9yZXNvdXJjZUdyb3Vwcy9iYXN0aW9uLW5vbnByb2QtcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9iYXN0aW9uLW5vbnByb2Qtdm5ldC9zdWJuZXRzL2Jhc3Rpb24ifV0="
          - "env"                        = "demo"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "ccd-user-profile-api-postgres-db-v11-demo"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "ccd-user-profile-api-postgres-db-v11-data-demo" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.user-profile-db-v11.null_resource.set-user-permissions[0] will be destroyed
  # (because null_resource.set-user-permissions is not in configuration)
  - resource "null_resource" "set-user-permissions" {
      - id       = "3896553241289582308" -> null
      - triggers = {
          - "db_reader_user" = "DTS CFT DB Access Reader"
          - "name"           = "ccd-user-profile-api-postgres-db-v11"
          - "script_hash"    = "03f79db43eea0260e31fe3dc6925df25b0373bdeb9982b92bedf86dfd47d593a"
        } -> null
    }

  # module.user-profile-db-v11.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "128714577533258000" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-demo/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-demo/subnets/core-infra-subnet-3-demo"
        } -> null
    }

  # module.user-profile-db-v11.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6620297955189835978" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks00"
          - "subnet_id" = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/virtualNetworks/cft-demo-vnet/subnets/aks-00"
        } -> null
    }

  # module.user-profile-db-v11.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2627408885834560056" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks01"
          - "subnet_id" = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/virtualNetworks/cft-demo-vnet/subnets/aks-01"
        } -> null
    }

  # module.user-profile-db-v11.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "9162264677229942579" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.user-profile-db-v11.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6023502008711994496" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.user-profile-db-v11.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "7015845320487748392" -> null
      - triggers = {
          - "rule_name" = "bastion-nonprod-vnet"
          - "subnet_id" = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet/subnets/bastion"
        } -> null
    }

  # module.user-profile-db-v11.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "-i:$k4&RuCtS<nLw" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "-i:$k4&RuCtS<nLw" -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 9 to add, 0 to change, 18 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":602,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->